// 그 다음 pages 배열을 export
export const pages = [{
        type: 'text',
        content: "금기에 관심을 두는 것은 인간의 본성이다.\n고상한 표현은 집어치우고 직설적으로 말해보자면, 원래 하지 말라는 일이 세상에서 제일 재미있는 법이다.\n\n\n어느 날 홀연히 나타나 이웃이 된 동년배의 소년은 참으로 수상했다.\n하얀 동시에 검다. 키가 크고 건강을 의심해야 할 정도로 말랐으며, 빅토리아 시대의 결핵 환자를 연상시키는 낯빛이 꽤 섬뜩했다.\n부모님도 비슷한 인상을 느꼈는지, 그 소년은 어쩐지 느낌이 좋지 않다며 꼭 거리를 두라고 하셨다.\n\n나는 착한 아들로서 그 말을 따르고 싶었지만...\n\n안타깝게도 내 안의 호기심은 나를 가만히 내버려두지 않았다.\n나는 결국 야구공이 그쪽으로 넘어갔다는 핑계로 그 소년의 집을 찾아가 대화를 걸었다.\n문을 열고 나온 소년, 가까이서 마주하니 눈가의 알 수 없는 검은 자국이며 뼈마디를 훤히 드러내는 검은 손가락들이 기묘하게 불쾌했다.\n그도 나의 표정을 의식했는지, 오히려 편히 불쾌해하라며 자학 섞인 농담을 던졌지만...\n.\n.\n.\n몇 번 더 대화를 나눠보니 오스월드는 내가 생각했던 것만큼 위험한 친구가 아니라는 확신이 들었다.\n오히려 타 지역에 있는 기숙학교에 다닐 정도로 똑똑한 친구였다."
    },
    {    
        type: 'text',
        content: "나는 오스월드가 옆집에 머무르는 동안 방학 과제에서 모르는 부분을 물어보곤 했다.\n오스월드는 성실하게 답해줬지만 끝까지 내가 이 부분을 왜 모르는지는 이해하지 못한 듯 했다.\n소위 말하는 천재라는 부류겠지.\n내 방학이 끝나기 이 주 전, 오스월드는 기숙학교에 돌아가기 위해 먼저 집을 떠났다.\n나는 다음에 만날 날을 기약하며 그에게 인사했다."
    },
    {
        type: 'text',
        content: "오스월드가 없는 시간은 생각보다 빠르게 흘러갔다.\n학교가 끝난 뒤 집에 돌아와 테트리스를 하다 보면 어느새 하루가 다 지나있었다.\n\n\n그리고 오늘, 드디어 해냈다.\n스스로도 달성할 수 있으리라고는 생각조차도 못 했던 그 점수.\n내가 그 테트리스에서 역대 최고 기록 14위에 준하는 점수를 달성한 것이다!\n몇 초 후에야 손을 번쩍 들고, 아무도 없는 방 안에서 포효했다.\n책상 밑으로 발을 차고, 의자를 뒤로 밀고, 정신없는 춤을 췄다.\n도저히 가만있을 수가 없다.\n이걸 당장 누군가에게 자랑해야 한다.\n누군가. 지금 당장 이 이야기를 들어줄 누군가. 그 순간 떠오른 건, 딱 한 사람.\n.\n.\n.\n방학이 시작해 다시 돌아온 오스월드."
    },
    {
        type: 'text',
        content: "K : 빨리 와, 오스월드! 오랜만에 자체 신기록을 경신했어! 봐봐, 여기 세계 14위라고 적혀있지?\n오스월드 : ...이게 뮙니까?\nK : 역시 범생이는 모르는 건가. 자, 봐. 이렇게 블록이 하나씩 내려오면...\n오스월드 : 테트리스 정도는 압니다. 저는 이 장치를 말한 겁니다.\n오스월드 : 벌써 기술이 이만큼 발전한 건가요.\nK : 너 컴팩 컴퓨터 처음 봐? 뭘 그렇게 만지작거리는 거야.\n오스월드 : 전에 아버지의 회사에서 데스크탑 PC를 몇 번 본 적이 있지만, 역시 신기하군요.\n오스월드 : 그야 몇 년 전까지만 해도 가정용 PC 보급률은 12% 이하였지 않습니까.\nK : 몰라... 누가 그런 수치를 일일이 기억하냐고.\n오스월드 : 아무튼 제게 말하고 싶었던 건 무엇입니까."
    },
    {
        type: 'text',
        content: "나는 내가 달성한 기록이 얼마나 대단한지 한참을 설명했다.\n싱거운 반응이 돌아올 줄 알았는데, 그는 내 말을 끝까지 듣고는 고개를 끄덕였다.\n오스월드 : 그렇군요. 당신은 반응 속도와 상황 예측력이 뛰어난 편일지도 모르겠습니다.\nK : 에이, 뭘 그렇게 띄워줘. 부끄러우니까 그만해~.\n오스월드 : 네, 그만하겠습니다.\nK : ...가차 없구나.\n오스월드 : 당신이 먼저 그만하라고 하지 않았습니까?\n오스월드 : 그것보다도 당신을 좀 더 자세히 관찰하고 싶으니, 제 질문에 답해주세요.\n\n오스월드는 수첩과 펜 하나를 꺼내들었다.\n\nK : 무슨 질문을... 그건 또 뭐야? 거기에 메모하게?\n오스월드 : 뭐든 손에 익은 물건이 편한 법이죠.\nK : 요즘은 다들 이런 전자 기기에 기록하는 추세인데도?\n오스월드 : 저는 괜찮습니다.\n오스월드 : 정보 손실 위험성도 높고, 어차피 제 학교에서는 쓰지 못할 테니까요.\nK : 요즘도 그런 곳이 있어?\nK : 어디 산골짜기에 있는 수도원에서 감금되어서 사는 건 아니지?\n오스월드 : 글쎄요, 생각하기 나름이겠죠."
    },
    {
        type: 'text',
        content: "갑자기 오스월드가 불쌍해보이기 시작했다. 물론 그는 고작 이런 것으로 자기 자신을 동정할 리 없겠지만, 나는 멋대로 오스월드를 컴퓨터 쪽으로 떠밀었다.\n\nK : 수첩 같은 건 잠시 내려놓고 너도 게임이나 한 번 즐겨봐.\n오스월드 : 괜찮습니다.\nK : 아냐, 오스월드는 머리가 좋으니까 금방 잘해낼 거야.\n오스월드 : 실력의 문제가 아닙니다.\n오스월드 : 저는 게임에 흥미가 없습니다. 게임을 좋아하는 당신 쪽이 더 하는 게 낫지 않을까요.\nK : 너도 막상 해보면 좋아하게 될 걸? 사실 얼마나 잘할지 궁금하기도 하고.\n오스월드 : 거절하겠습니다.\n\n나는 강제로 마우스 위에 오스월드의 손을 얹은 뒤 테트리스에 대한 설명을 이어갔다.\n\nK : 이걸 누르면 블록을 회전시킬 수 있고, 이렇게 한 줄이 전부 차면 점수가 쌓여.\n오스월드 : ...하고 싶지 않습니다.\n\n그러거나 말거나, 나는 막무가내로 시작 버튼을 눌렀다."
    },
    {
        type: 'tetris',
        content: "",
        scoreKey: 'oswaldFirstScore'
    },
    {
        type: 'text',
        content: "오스월드 : ...\nK : 음. 그래도 초심자치고는 나쁘지 않아.\n오스월드 : 당신의 반응을 보아하니 그닥 높은 점수는 아닌 듯 하군요.\nK : 뭐, 나와 비교해서는 그렇지.\n오스월드 : 조금 흥미가 생겼습니다. 잠시 컴퓨터를 빌려도 됩니까?\nK : 정말? 나야 환영이지. 하고 싶은 만큼 해.\nK : 나는 옆방에서 과제나 하고 있을 테니까 궁금한 거 생기면 언제든지 부르고.\n\n말이 떨어지기 무섭게 오스월드는 버튼을 눌러 테트리스를 시작했다.\n나는 딸깍이는 키보드 소리를 뒤로하고 옆방에 들어가 과제를 펼쳤다.\n.\n.\n.\n.\n그리고 언제부터였을까.\n오스월드가 있는 방에서는 아무런 소리도 나지 않게 되었다.\n테트리스 특유의 경쾌한 효과음도, 키보드를 두드리는 소리도 들리지 않았다.\n나는 그 고요함에 취해 그만 곯아떨어지고 말았다."
    },
    {
        type: 'text',
        content: "불현듯 오싹한 기분이 들어 눈을 떴다.\n잘 기억나지는 않지만 아주 끔찍한 꿈을 꾼 것 같기도 했다.\n바깥은 이미 어두웠다.\n오후 10시... 오스월드는 벌써 돌아갔겠지.\n나는 방문을 열었다. 불이 꺼져 어두워야 했을 방은 모니터에서 나오는 빛으로 훤했다.\n오스월드는 그 앞에 앉아 고요하게 화면을 바라보고 있었다.\n\nK : ...너 뭐해? 왜 아직 집에 안 간거야?\n오스월드 : 랜덤 블록이라도 반복되는 고정 패턴이 몇 있더군요.\n오스월드 : 기계가 만들어내는 난수의 한계입니다.\n오스월드 : 그래서 정리해뒀습니다. 신기록 달성에 도움이 되길 바랍니다.\nK : 계속 이걸 작성하고 있던 거야?\n오스월드 : 네. 게임은 생각보다 재미있는 걸지도 모르겠습니다.\nK : 아니, 테트리스는 패턴을 분석하는 게임이 아니라... 따지자면 순발력과 상황 판단력을 겨루는 게임이라고."
    },
    {
        type: 'text',
        content: "오스월드는 내 앞으로 작성한 분석지를 들이밀었다. 나는 가장 위에 놓인 페이지를 훑었다.\n\n[S = {I, O, T, S, Z, J, L} // 집합]\n[n ∈ ℕ // n은 블록이 떨어진 횟수]\n[P(n): ℕ → S // n번째에 생성되는 블록]\n[P(n)=π⌊n/7⌋[nmod7]πk=Shuffle(S,seed=k∗c)]\n[P(n)=S[(n2+3n+1)mod7]ifnmod4=0S[(5n+1)mod7]ifnmod4=0]\n.\n.\n.\n시작하세요.\n오스월드가 중얼거렸다.\n내가 답을 하지 않자 오스월드는 목소리를 조금 더 키운 뒤 같은 말을 반복했다.\n\n시작하세요."
    },
    {
        type: 'tetris',
        content: "",
        scoreKey: 'oswaldFirstScore'
    },
    {
        type: 'text',
        content: "오스월드 : 아쉬운 점수입니다. 숙지가 덜 되었군요.\n오스월드 : 분석지를 다시 제대로 암기하고 몇 번의 연습을 통해 체화하면……\n\nK : 됐어. 그렇게까지 해가며 신기록을 세우고 싶은 건 아니야...\n오스월드 : 의외의 반응이네요. 기뻐할 거라고 생각했습니다.\nK : 너, 사람들이 왜 게임을 하는 줄은 알아?\n오스월드 : 도전과 보상을 반복하는 구조가 도파민 분비를 유도하여...\nK : 그딴 게 아니야! 테트리스는 정답이나 공략법이 없기 때문에 재밌는 거야!\nK : 모두가 같은 무작위성 아래에서 최선을 다해 실력을 겨루는 게임이란 말이야...\n\n오스월드 : 최선을 다한다,라..., 결과적으로 도달하고자 하는 방향은 저와 같지 않습니까?\n오스월드 : 다만 이 최선을 위해 패턴을 분석하고, 외우고, 그걸 적용하기까지 너무 오랜 시간이 걸리는 것 같군요.\n오스월드 : 이렇게 비효율적일 리 없습니다.\n\n오스월드 : 게임 자체의 구조를 개편해서 원하는 블록만 내리도록 하는 방법이 분명 있을 겁니다.\nK : 그건 말도 안 돼!"
    },
    {
        type: 'text',
        content: "**[import random \nblocks = ['I', 'O', 'T', 'S', 'Z', 'J', 'L']\nnext_block = random.choice(blocks)]**\n\n오스월드는 잔뜩 분개한 나를 무시하고선 타이핑해가기 시작했다.\n\n**[fixed_sequence = ['I', 'O', 'T', 'S', 'Z', 'J', 'L']\nfor block in fixed_sequence:\nprint(\"Next block:\", block)**"
    },
    {
        type: 'text',
        content: "오스월드 : 시작하세요."
    },
    {
        type: 'tetris2',
        content: "",
        scoreKey: 'oswaldSecondScore'
       },
    {            
        type: 'text',
        content: "오스월드 : 왜 중도에 포기하셨습니까?\nK:...\n오스월드 : 1위에 이름을 올려드릴까요?\n\n나는 말없이 오스월드를 노려보았다.\n그가 개조한 테트리스의 창을 닫고 다시 열어보았지만 게임은 제대로 작동하지 않았다.\n지금껏 내가 이 컴퓨터에서, 이 프로그램으로 쌓아온 모든 기록과 추억이 의미 없는 데이터 쓰레기가 되었다. 그러나 내게는 더 이상 게임을 복구하고 싶다는 의지조차 남아있지 않았다.\n오스월드라면 테트리스의 조작을 원래대로 돌려낼 수도 있겠지만, 그를 몰아붙이거나 분노를 드러내면서까지 그 기록들을 돌려받고 싶지 않았다.\n어쩌면...아무리 설명해봤자, 오스월드를 이해시킬 수 없겠다는 사실에 눈 앞이 아득해진 것일지도 모르겠다.\n\n오스월드 : 좋은 경험을 했군요. 덕분에 제가 갖고 있던 고민에 대한 해답을 찾은 것 같습니다.\nK : 왜, 이제 다른 게임들도 전부 네 마음대로 뜯어 고치려고?\n오스월드 : 아직 당신에게 설명할 수 있는 단계는 아니라고 생각합니다.\nK : 그래. 어차피 설명해봤자 나 같은 건 알아듣지도 못할테니!"
    },
    {            
        type: 'text',
        content: "...잠시간의 정적. 오스월드는 조용히 고개를 옆으로 돌렸다.\n순간, 눈가에 번진 검은 얼룩이 그를 마치 울고 있는 사람처럼 보이게 만들었다.\n다시금 내 눈을 마주한 그는 언제나처럼 무표정한 얼굴을 하고 있었다.\n\n다만, 그 눈동자에 맺힌 무언가는... 나를 이해하지 못한다는 사실에 슬픔을 느낀 건지,\n아니면 자신의 해답을 받아들이지 못하는 나를 동정한 것인지…\n나는 끝내 알 수 없었다."
        },
    {            
        type: 'text',
        content: "나는 그 이후로 오스월드와의 교류를 끊었다.\n테트리스는 더 이상 플레이할 수 없게 되었지만, 세상에는 다른 게임도 많이 있다.\n하지만 어느 게임이든 뜻대로 풀리지 않을 때면, 문득 오스월드가 떠오른다.\n오스월드의 손을 빌릴 수만 있다면, 이런 것쯤은...\n\n동시에 그가 없었더라면 즐거움이 되었을 고난들이 지금은 언제든 조작 가능한 수치의 집합으로밖에 보이지 않게 되었다.\n나는 본래의 즐거움을 되찾을 수 있도록 노력했지만, 그 네모 반듯한 정사각형 블록들을 떠올릴 때마다 가슴 속에서 알 수 없는 분노가 치솟았다.\n그래도, 겨우 게임 하나로 좋은 친구를 잃는 것은 아쉽다는 생각이 들었다.\n그렇게 게임을 망가뜨린 것도 결국은 내가 더욱 높은 기록을 세우길 바라서였던 게 아닐까.\n\n그래. 아마 나쁜 의도는 없었을 것이다."
    },
    {            
        type: 'text',
        content: "나는 오랜만에 음료수 한 캔을 들고 오스월드의 집을 찾아갔다.\n벨을 누르기까지 많은 시간이 필요했다.\n그동안 머리를 매만지고, 괜히 옷매무새를 다듬었다.\n혹시 오스월드가 이 음료수를 싫어하면 어쩔까 하는 걱정을 하기도 했다.\n\n\n그러나 문을 열고 나온 사람은 금발머리의 남자아이로,\n오스월드는 이미 이사를 가버린 모양이었다.\n.\n.\n.\n.\n.\n.\n.\n[END]"
    }
];
