export const pages = [{
        type: 'text',
        content: "오스월드 화이트, 그 애는 일주일 전부터, 옆집에 혼자 들어와 살기 시작했다.\n또래라는 말에 인사라도 해볼까 했지만, 도통 마주칠 기회가 없었다.\n어느 학교를 다니는지도 알 수 없다.\n방학 때 돌아와 잠깐 얼굴을 비추는 게 전부.\n\n부모님은 '어쩐지 느낌이 좋지 않다'며, 가까이 지내지 말라고 했지만\n…나 같은 열네 살 남자애에게 이건 몰래 친해져보라는 부추김에 가깝다.\n결국 나는 방학 과제를 핑계 삼아, 그에게 찾아가 말을 걸기 시작했다.\n\n.\n.\n.\n대화를 두세번 나눠본게 전부지만 나는 확신할 수 있었다!\n오스월드는 부모님 말처럼 '나쁜 애'는 아니라고.\n하지만 조금 더 친해질 만하면, 그 애는 어김없이 몇달씩 자리를 비워버렸다…\n요즘 나는 종종 오스월드를 그린다.\n조용하고 낯선 옆집 소년.\n어서 방학을 마치고, 돌아왔으면 좋겠다고….",
    },
    {
        type: 'text',
        content: "드디어 해냈다.\n스스로도 말도 안 된다고 생각했던 그 점수.\n기기 오작동이나 착각이 아니고, 진짜로. 진짜로~.\n내가, 그 [테트리스]에서, 전세계 14등을 달성한 것이다!\n몇 초 후에야 손을 번쩍 들고, 아무도 없는 방 안에서 포효했다.\n책상 밑으로 발을 차고, 의자가 뒤로 밀려나고, 정신없는 춤 같은 걸 췄다.\n도저히 가만있을 수가 없다.\n이걸 당장 누군가에게 말해야 한다.\n누군가. 지금 당장 이 이야기를 들어줄 누군가.\n그 순간 떠오른 건, 딱 한 사람.\n.\n.\n.\n방학이 시작해 다시 돌아온 오스월드.",
    },
    {
        type: 'text',
        content: "K : 빨리 와, 오스월드! 이번에 자체 신기록을 경신했어! 순위권에도 올랐고~.\n\n오스월드 : 이게 뭡니까?\nK : 아니, 너 테트리스를 몰라? 자, 봐, 이렇게 블록이 하나씩 내려오면……\n오스월드 : 아니요, 이 장치를 말한 겁니다. 벌써 기술의 발전이 여기까지 온 건가요.\nK : 너 최신형 컴퓨터 처음 봐? 뭘 그렇게 만지작거리는 거야.\n오스월드 : 아버지의 회사에서 몇 번 본 적이 있지만, 역시 신기하군요.\n오스월드 : 그야 몇 년 전까지만 해도 가정용 컴퓨터 보급률은 15% 이하였지 않습니까.\nK : 그딴 수치 몰라… 언제적 얘기를 하고 있는 거야.\n오스월드 : 아무튼 제게 말하고 싶었던 건?\nK : 이것 봐, 내 게임 순위야. 시작한 지 얼마 안 됐는데 이 정도면 대단한 거라고.\n오스월드 : 그런가요. 당신은 반응 속도와 상황 예측력이 뛰어난 편일지도 모르겠습니다.\nK : 아니 뭘 그렇게까지 띄워줘~. 부끄러우니깐 그만해!\n오스월드 : 네, 그만하겠습니다.\nK : …가차 없구나.\n오스월드 : 것보다 당신을 더 자세히 관찰해보고 싶군요.\n오스월드 : 잠깐 시간을 내어 몇 가지 질문에 답해 주시기 바랍니다."
    },
    {
        type: 'text',
        content: "나는 마우스 위에 오스월드의 강제로 손을 얹고, 테트리스에 대한 설명을 이어갔다.\nK : 이 버튼을 누르면 블록을 회전시킬 수 있고…\nK : 이렇게 한 줄이 전부 차면 블록이 사라져.\n오스월드 : 규칙은 어렵지 않군요.\nK : 원래 단순한 것들이 제일 재미있는 법이야."

    },
    {
        type: 'tetris',
        content: "",
        scoreKey: 'oswaldFirstScore'
    },
    {
        type: 'text',
        content: "오스월드 : 이건 어느 정도입니까?\nK : 음…… 그래도 처음 치고는 나쁘지 않아.\n오스월드 : 그닥 높은 점수는 아닌 모양이군요.\nK : 나와 비교해서는 그렇지.\n오스월드 : 흥미가 생겼습니다. 잠시 컴퓨터를 빌려도 됩니까?\nK : 정말? 나야 환영이지. 하고 싶은 만큼 해.\n나는 옆방에서 과제나 하고 있을 테니까.\n\n그 말과 동시에 오스월드는 화면 아래의 버튼을 눌러 테트리스를 다시 시작한다.\n딸깍이는 키보드 소리를 뒤로 하고 나는 옆방에서 과제를 하기 시작했다."


    },
    {
        type: 'text',
        content: "언제부터였을까.\n아무 소리도 나지 않게 되었다.\n테트리스 특유의 경쾌한 효과음도, 키보드를 두드리는 리듬도 사라진 뒤였다.\n고요한 집… 나는 어느새 책상에 엎드려 잠에 빠져들었다.\n불현듯, 오싹한 기분에 잠에서 깼다. 뭔가 기분 나쁜 꿈을 꾼 것 같고.\n밖은 어둡다. 어림잡아도 7시간은 지난 것 같다…\n\nK : 오스월드는 집에 갔겠지.\n\n나는 방 문을 열어보았다.\n어두운 방 안. 환한 빛을 내는 컴퓨터 앞에 오스월드는 여전히 앉아 있었다.\n마우스와 키보드에는 손도 대지 않고 화면만을 응시하고 있다.\n\nK : …너 여기서 뭐해?\n오스월드 : 랜덤 블록이어도 반복된 고정 패턴이 몇 있더군요.\n오스월드 : 그래서 정리해 뒀습니다. 신기록에 도움이 되길 바랍니다.\nK : 쭉 이걸 분석한 거야?\n오스월드 : 네. 게임은 생각보다 재밌는 건지도 모르겠습니다.\nK : 아니, 테트리스는 패턴을 분석하는 게임이 아니라……\nK : 이건 따지자면 순발력 게임이라고.\n오스월드는 아랑곳하지 않고 나의 손을 끌어 의자에 앉힌다."
    },
    {
        type: 'text',
        content: "\n내 앞에 오스월드가 작성한 분석지가 들이밀어진다.\n\n[S = {I, O, T, S, Z, J, L} // 집합]\n[n ∈ ℕ  // n은 블록이 떨어진 횟수]\n[P(n): ℕ → S  // n번째에 생성되는 블록]\n[P(n)=π⌊n/7⌋[nmod7]πk=Shuffle(S,seed=k∗c)]\n[P(n)=S[(n2+3n+1)mod7]ifnmod4=0S[(5n+1)mod7]ifnmod4=0]\n\n.\n.\n.\n알 수 없는 끝없는 숫자의 나열, 다섯장이 빽빽하게 채워져있다.\n오스월드 : 시작하세요."
                
        ,
    },
    {
        type: 'tetris',
        content: "",
        scoreKey: 'oswaldSecondScore'
    },
    {
        type: 'text',
        content: "오스월드 : 아쉬운 점수입니다. 숙지가 덜 되었군요.\n오스월드 : 분석지를 다시 제대로 외우고 몇 번의 연습을 통해 체화하면……\n\nK : 됐어. 그렇게까지 해가며 신기록을 세우고 싶은 건 아니야...\n오스월드 : 의외의 반응이네요. 기뻐할 거라고 생각했습니다.\nK : 너, 사람들이 게임을 왜 하는 줄은 알아?\n오스월드 : 짧은 보상이 반복되는 구조가 도파민 분비를 유도하기 때문이죠.\nK : 그런 형식적인 대답 말고! 테트리스는 정답이나 공략법이 없기 때문에 재미있었던 거야!\nK : 랜덤 확률에서 최선을 겨루는 게임이란 말이야…\n\n오스월드 : '최선'이라... 결과적으로 도달하고자 하는 방향은 저와 같지 않습니까?\n오스월드 : 다만 이 최선을 위해 패턴을 분석하고, 외우고, 그걸 적용하기까지 너무 오랜 시간이 걸리는 것 같군요.\n오스월드 : 이렇게 비효율적일 리 없습니다.\n\n오스월드 : 게임 자체의 구조를 개편해서 원하는 블록만 내리도록 하는 방법이 분명 있을 겁니다.\nK : 그건 말도 안 돼!"

    },
    {
        type: 'text',
        content: "**[import random \nblocks = ['I', 'O', 'T', 'S', 'Z', 'J', 'L']\nnext_block = random.choice(blocks)]**\n\n오스월드는 글자를 타이핑하기 시작했다.\n\n**[fixed_sequence = ['I', 'O', 'T', 'S', 'Z', 'J', 'L']\nfor block in fixed_sequence:\nprint(\"Next block:\", block)**"
    },
    {
        type: 'text',
        content: "\n\n상단에 나타나는 블록은 전부 정사각형 하나뿐이다.\n정사각형은 오스월드가 키보드를 두드릴 필요 없도록 필요한 위치로 알아서 이동한다.\n게임은 계속 진행된다.\n오스월드는 손 하나 까딱하지 않는다.\n시간이 흘러 화면에 점수판이 표시된다. 알 수 없는 물음표만 가득하다.\n\nK : 게임이 측정할 수 있는 점수를 넘은 거야.\n오스월드 : 당연한 결과입니다. 신기록에 이름을 올려드릴까요?\n\nK : …너에게 이 게임을 알려준 걸 후회할 것 같아나는 말없이 오스월드를 노려본다.\n테트리스는 이제 플레이할 수 있는 상태가 아니다.\n게임을 재차 종료한 뒤에도 무언가 오류가 났는지 제대로 작동되지 않는다.\n나는 복구할 의지조차 사라져버렸다.\n\n오스월드 : 좋은 경험이었습니다.\n오스월드 : 더불어 제가 갖고 있던 고민에 대한 해답도 찾은 것 같습니다.\nK : 무슨 해답? 네가 게임을 망가뜨린 것 말고 또 뭐가 있다는 거야?\n오스월드 : 아직은 설명할 수 있는 단계가 아닌 것 같습니다."

    },
    {
        type: 'text',
        content: "나는 이후 오스월드의 집에 발걸음을 끊었다.\n테트리스는 더 이상 플레이할 수 없었지만, 새롭게 출시된 다른 게임들을 즐기곤 했다.\n하지만 어느 게임이든 뜻대로 풀리지 않을 때면, 문득 오스월드가 떠오른다.\n동시에 내가 그렇게 좋아했던 게임들이 언제든 조작 가능한 수치의 집합이라는 사실이 불쑥 떠오를 때마다, 알 수 없는 분노가 치솟곤 했다.\n\n그래도— 겨우 게임 하나로 좋은 친구를 잃기엔 아쉽다는 생각이 들었다.\n아마 나쁜 의도로 한 게 아니었을 테니까…\n\n그런 마음으로, 나는 오랜만에 음료수 한 캔을 들고 그의 집을 찾아갔다.\n벨을 누르며 괜히 한 번 머리를 매만지고, 가슴팍에 숨결을 고르게 댔다.\n\n하지만 문을 열고 나온 건 금발머리를 한 작은 여자아이로,\n아무래도 오스월드는 이미 이사를 가버린 모양이었다.\n\n[END]"


    },
];
